## Tarea 2 A01 python

#### Primer punto

#### Segundo punto

In [11]:
conda install pandas

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [12]:
import pandas as pd

In [13]:
pd.read_excel?

In [18]:
data = pd.read_excel("datosPE.xlsx")

In [25]:
data["Indice"] = data["Peso"]/data["Estatura"]

In [27]:
data

    ID Persona  Peso  Estatura     Indice
0            1    67      1.41  47.517730
1            2    99      1.83  54.098361
2            3    86      1.90  45.263158
3            4   118      1.65  71.515152
4            5   109      1.67  65.269461
..         ...   ...       ...        ...
95          96    88      1.49  59.060403
96          97    98      1.54  63.636364
97          98    95      1.57  60.509554
98          99    61      1.61  37.888199
99         100   107      1.62  66.049383

[100 rows x 4 columns]

#### Tercer Punto

In [38]:
datas = pd.read_excel("datosCT.xlsx")

In [39]:
datas

    Unnamed: 0  Ingreso  Gasto
0        Enero     1340   1880
1      Febrero     2590   3130
2        Marzo     3570   2140
3        Abril     4450   3370
4         Mayo     1330   2990
5        Junio     1610   1970
6        Julio     1500   2230
7       Agosto     2270   1240
8   Septiembre     1910   1470
9      Octubre     2120   2280
10   Noviembre     3950   1870
11   Diciembre     1380   3140

##### Utilidad

In [42]:
datas["Utilidad"] = datas["Ingreso"]-datas["Gasto"]

In [43]:
datas

    Unnamed: 0  Ingreso  Gasto  Utilidad
0        Enero     1340   1880      -540
1      Febrero     2590   3130      -540
2        Marzo     3570   2140      1430
3        Abril     4450   3370      1080
4         Mayo     1330   2990     -1660
5        Junio     1610   1970      -360
6        Julio     1500   2230      -730
7       Agosto     2270   1240      1030
8   Septiembre     1910   1470       440
9      Octubre     2120   2280      -160
10   Noviembre     3950   1870      2080
11   Diciembre     1380   3140     -1760

##### Promedio de Gastos

In [54]:
gastos = [1880,3130,2990,1970,2230,2280,4140]

In [56]:
prom = sum(gastos) / len(gastos)

In [59]:
prom ## No pude usar el comando mean()

2660.0

#### Ingresos totales del año

In [61]:
ingre = datas["Ingreso"].sum()

In [62]:
ingre

28020